/*
fetch ფუნქცია javaScript-ში გამოიყენება ქსელური
მოთხოვნების გასაგზავნად, ის აბრუნებს Promise-ს
რომელიც სრულდება response ობიექტების მიღებისთანავე. 
იმისათვის, რომ მონაცემები წავიკითხოთ, საჭიროა .json()
მეთოდის გამოყენება, რომელიც თავის მხრივ  

  */

// საჯარო api-ს მისამართი
const API_URL = "https://jsonplaceholder.typicode.com/posts";

console.log("მონაცემების წამოღება დაიწყო...");

fetch(API_URL)
.then((response) => {
    //ვამოწმებთ, წარმატებულია თუ არამოთხოვნა 


if (!response.ok) {
throw new Error("ქსელური შეცდომა:" + response.status); 
} 
//გადაყავს პასუხი json ფორმატში
return response.json();  
})
.then ((posts) => {
    // აქ უკვე ქვაქვს მონაცემები მასივის სახით
    console.log("მონაცემები წარმატებით მიღებულია:");
    console.log(posts.slice(0, 5));
    //გამოვიტანოთ მხოლოდ პირველი 5პოსტი  
})
.catch((error) => {
    //აქ მოხება სეცდომის დამუშავება 
    console.error("დაფიქსიდა შეცდომა:", error);
})

/*
რა ხდება ამ კოდსი?
fetch(API_URL): აგზავნის HTTP GET მოთხოვნას
მითითვებულ მისმართზე.
response.ok: ეს არის ბულენური მნიშვნელობა.
ის true-ია, თუ სერვერმა დააბრუნა წარმატებული სტატუსი
(მაგალითად, 200 ok) 
response.json(): ეს მეთოდი სერვერიდან მირებულ "ნედლ"
მონაცემებს გარდაქმნის javascript-ის ობიექტურად ან მასივად,
try...catch; async/await-თან მუშაობისას ეს
საუკეთესო გზაა შეცდომების (მაგალითდ, ინტერნეტის გათიშვისას დასაჭერად...)
 */ 